#!/usr/bin/env python3
# -*- coding:utf-8 -*-
# Author: davie
"""
打印省、市、区/县三级菜单
可返回上一级
可随时退出程序
1、打印一级省份菜单
2、判断用户的输入是否在一级省份菜单中，不存在的话，提示错误信息
(
1，如果存在，提示输入二级菜单 ，否则提示不存在
2，如果输入的在二级菜单，打印3级菜单，不存在提示有误
)
"""
provinces_name = {
"山东省":{
    "青岛市":{
         "市南区":["八大峡街道办事处","云南路街道办事处","中山路街道办事处"],
         "黄岛区":["琅琊镇","泊里镇","大场镇","大村镇","六汪镇","王台镇","海青镇"],
         "崂山区":["李村镇","城阳镇","流亭镇","夏庄镇","惜福镇","棘洪滩镇","上马镇"],
         "李沧区":["大港街道","兴隆路街道","水清沟街道","四方街道","即墨路街道"],
         "市北区":["城阳街道","惜福街道","夏庄街道","流亭街道","棘洪滩街道","上马街道"]
            },
    "济南市":{
         "历城区":["历下区","市中区","槐荫区","天桥区","历城区","长清区","章丘区"],
         "槐荫区":["振兴街街道","西市场街道","五里沟街道","青年公园街道","道德街街道","中大槐树街道"],
         "天桥区":["堤口路街道","制锦市街道","纬北路街道","工人新村北村街道","官扎营街道"],
         "长青区":["文昌街道","平安街道","崮云湖街道","五峰山街道","归德街道","万德街道"],
         "章丘区":["明水街道","双山街道","圣井街道","埠村街道","枣园街道","相公庄街道"]
            },
    "烟台市":{
        "龙口区":["东莱街道","龙港街道","新嘉街道","徐福街道","东江街道","黄山馆镇"],
        "莱山区":["滨海路街道","院格庄街道","莱山街道","解甲庄街道","初家街道","黄海路街道"],
        "牟平区":["宁海街道","文化街道","大窑街道","姜格庄街道","武宁街道","高陵镇","观水镇"],
        "蓬莱区":["登州街道","紫荆山街道","新港街道","蓬莱阁街道","南王街道","刘家沟镇","潮水镇"],
        "招远区":[]
             }
        },
"广东省":{
    "广州市": {
            "天河区":["五山街道","员村街道","车陂街道","沙河街道","石牌街道","兴华街道"],
            "海珠区":["赤岗街道","新港街道","昌岗街道","江南中街道","滨江街道","素社街道"],
            "越秀区":["洪桥街道","六榕街道","流花街道","光塔街道","人民街道","东山街道"],
            "白云区":["三元里街道","松洲街道","景泰街道","黄石街道","同德街道","棠景街道"],
            "黄埔区":["萝岗街道","夏港街道","联和街道","东区街道","永和街道","黄埔街道"]
              },
    "深圳市": {
            "罗湖区":["桂园街道","黄贝街道","东门街道","南湖街道","笋岗街道","东湖街道"],
            "福田区":["园岭街道","南园街道","福田街道","沙头街道","梅林街道","华富街道"],
            "南山区":["南山街道","南头街道","西丽街道","沙河街道","蛇口街道","招商街道"],
            "宝安区":["新安街道","西乡街道","福永街道","沙井街道","松岗街道","石岩街道"],
            "龙华区":["观湖街道","民治街道","龙华街道","大浪街道","福城街道","观澜街道"]
              },
    "佛山市": {
            "禅城区":["祖庙街道","石湾街道","张槎街道","南庄镇"],
            "高明区":["荷城街道","杨和镇","更合镇","明城镇","西安街道"],
            "三水区":["西南街道","云东海街道","白坭镇","乐平镇","大塘镇"],
            "南海区":["桂城街道","里水镇","九江镇","丹灶镇","大沥镇","狮山镇"],
            "顺德区":["大良街道办事处","容桂街道办事处","伦教街道办事处","勒流街道办事处","陈村镇"]
              }
        },
"江苏省":{
    "南京市": {
            "六合区":["雄州街道","龙池街道","程桥街道","金牛湖街道","横梁街道","龙袍街道"],
            "秦淮区":["秦虹街道","夫子庙街道","红花街道","双塘街道","中华门街道","五老村街道"],
            "浦口区":["泰山街道","顶山街道","沿江街道","盘城街道","江浦街道","桥林街道"],
            "栖霞区":["马群街道","栖霞街道","龙潭街道","仙林街道","八卦洲街道","西岗街道"],
            "江宁区":["东山街道","秣陵街道","汤山街道","淳化街道","江宁街道","谷里街道"]
              },
    "苏州市": {
            "相城区":["元和街道","太平街道","黄桥街道","北桥街道","望亭镇","黄埭镇"],
            "姑苏区":["观前街道","平江街道","苏锦街道","娄门街道","桃花坞街道","城北街道"],
            "虎丘区":["狮山街道","枫桥街道","横塘街道","镇湖街道","东渚街道","通安镇"],
            "吴中区":["香山街道","城南街道","郭巷镇","东山镇","光福镇","浦庄镇","渡村镇"],
            "昆山区":["玉山镇","巴城镇","花桥镇","周市镇","千灯镇","陆家镇"]
              },
    "无锡市": {
            "梁溪区":["崇安寺街道","通江街道","广瑞路街道","上马墩街道","江海街道","广益街道"],
            "新吴区":["鸿山街道","江溪街道","旺庄街道","硕放街道","梅村街道","新安街道"],
            "惠山区":["堰桥街道","长安街道","钱桥街道","前洲街道","玉祁街道","洛社镇","阳山镇"],
            "锡山区":["东亭街道","东北塘街道","安镇街道","厚桥街道","云林街道","东港镇","锡北镇"],
            "江阴区":["澄江街道","南闸街道","云亭街道","璜土镇","月城镇","青阳镇","徐霞客镇"]
            }
        }
}
exit_flag = False
# def pname():
#     print("----------一级菜单-开始----------")
#     for pname in provinces_name:
#         print(pname)
#     print("----------一级菜单-结束----------")
while not exit_flag:
    for pname1 in provinces_name:
        print(pname1)
    choice1 = input("已经进入1级菜单,按b返回,q退出>>： ")
    if choice1 in provinces_name:
        while not exit_flag:
            for pname2 in provinces_name[choice1]:
                print('\t', pname2)
            choice2 = input("已经选进入2级菜单,按b返回,q退出>>： ")
            if choice2 in provinces_name[choice1]:
                while not exit_flag:
                    for pname3 in provinces_name[choice1][choice2]:
                        print("\t\t",pname3)
                    choice3 = input("已经选进入3级菜单,按b返回,q退出>>： ")
                    if choice3 in provinces_name[choice1][choice2]:
                        for pname4 in provinces_name[choice1][choice2][choice3]:
                            print(pname4)
                        choice4 = input("最后一层，按b返回,q退出>>: ")
                        if choice4 == "b":
                            pass
                        elif choice4 == "q" or  choice4 != "b":
                            print("你输入的非b、q或正确的值，程序退出!")
                            exit_flag = True
                    elif choice3 == "b":
                        break
                    elif choice3 == "q" or  choice3 != "b":
                        print("你输入的非b、q或正确的值，程序退出!")
                        exit_flag = True
                    elif choice3 not in provinces_name[choice1][choice2]:
                        print("你输入的有误，请重新选择")
            elif choice2 == "b":
                break
            elif choice2 == "q" or  choice2 != "b":
                print("你输入的非b、q或正确的值，程序退出!")
                exit_flag = True
            elif choice2 not in provinces_name[choice1]:
                print("你输入的有误，请重新选择")
    elif choice1 == "b":
        break
    elif choice1 == "q":
        exit_flag = True
    elif choice1 not in provinces_name:
        print("你输入的有误，请重新选择")