#!/usr/bin/env python3
# -*- coding:utf-8 -*-
# Author: davie
"""
需求：
可依次选择进入各子菜单
可从任意一层往回退到上一层
可从任意一层退出程序
所需新知识点：列表、字典

1、一级菜单：北京、深圳
2、二级菜单：北京(海淀、昌平、朝阳)
3、三级菜单：海淀(五道口、中关村、上地)
4、底层显示：上地(百度)

测试过程：
1、启动程序后，打印"北京、深圳"一级菜单，输入"北京"，打印"海淀、昌平、朝阳",输入"海淀"，打印"五道口 中关村 上地"， 输入"五道口",打印"shoho 网易 google";
2、此时，输入b，返回上一级，打印"五道口 中关村 上地",接着输入b，返回上一级”海淀、昌平、朝阳“，接着输入b，返回”北京 深圳“
3、输入q，退出。
4、重新启动程序，输入错误的信息，提示”你输入的有误，请重新选择“，并打印一级菜单。输入q，则退出菜单。
5、重新启动程序，输入“深圳”，打印“南山 福田 宝安”，输入错误信息，提示“你输入的有误，请重新选择”，打印“南山 福田 宝安”，输入“南山”，
   打印“南山街道 蛇口街道”，输入”南三街道“，打印”南头城 大新 大汪山 红花园 田厦“，提示”如上是最后一层，按b返回,q退出“
 
6、重新启动程序，输入“北京”，打印“海淀、昌平、朝阳”，输入“海淀”，打印“五道口 中关村 上地”，

经过测试： 可以满足如下需求：
可依次选择进入各子菜单
可从任意一层往回退到上一层
可从任意一层退出程序
"""
menu = {
	"北京":
{
		"海淀":{
			"五道口":{"shoho":{"name":"搜狐公司","主营业务":["新闻","视频","搜索","游戏"]},
			          "网易":{"name":"网易公司","主营业务":["中文全文检索","免费邮件系统","国产网络游戏"]},
			          "google":{"name":"谷歌公司","主营业务":["互联网搜索","云计算","广告技术"]}},
			"中关村":{"爱奇艺":{"name":"爱奇艺视频","主营业务":["电商","游戏","电影票"]},
			          "汽车之家":{"name":"汽车之家","主营业务":["车媒体","车电商","车金融","车生活"]},
                      "youku":{"name":"优酷网","主营业务":["会员","游戏","支付","智能硬件和艺人经纪"]}},
			"上地":{"百度":{"name":"百度公司","主营业务":["全球最大的中文搜索引擎","百度地图","百度百科"]}}
				},
		"昌平":{
			"沙河":{"老男孩":{},"北航":{}},
			"天通苑": {"链家地产":{},"天通苑物业":{}}
				},
		"朝阳": {
			"国贸":{"cctv":{},"oracle":{}},
			"三元桥":{"海航集团":{},"国美":{}},
			"望京":{"奔驰":{},"sony":{}}
				}
			},
	"深圳":{
		"南山":{
			"南山街道":{"南头城","田厦","大新","大汪山","红花园"},
			"蛇口街道":{"东角头","湾厦","海湾","渔一","渔二","海滨"}
		},
		"福田":{
			"园岭街道":{"上林","鹏盛","红荔","红荔","南天"},
			"南园街道":{"东园","田滨江厦","沙埔头","南园","园西"},
			"沙头街道":{"新沙","新洲","上沙","下沙","天安"}
		},
		"宝安":{
			"龙华":{"民治","龙华","大浪"},
			"公明":{"光明","李松蓢","下村","下村","西田"},
			"沙井":{"新桥","新二","上星","下万丰沙","沙一"}
		}
	}
}
flag_exit = False
while not flag_exit:
	for i in menu:
		print(i)
	choice1 = input("已经进入1级菜单,按b返回,q退出>>： ").strip()
	if choice1 in menu:
		while not flag_exit:
			for i2 in menu[choice1]:
				print("\t",i2)
			choice2 = input("已经选进入2级菜单,按b返回,q退出>>： ").strip()
			if choice2 in menu[choice1]:
				while not flag_exit:
					for i3 in menu[choice1][choice2]:
						print("\t\t",i3)
					choice3 = input("已经选进入3级菜单,按b返回,q退出>>： ").strip()
					if choice3 in menu[choice1][choice2]:
						for i4 in menu[choice1][choice2][choice3]:
							print(i4)
						choice4 = input("如上是最后一层，按b返回,q退出>>: ").strip()
						if choice4 == "b":
							pass
						elif choice4 == "q":
							flag_exit = True
						else:
							print("输入有误,返回上一次!")
							choice4 = "b"
						# else:
						# 	flag_exit = True
					elif choice3 == "b":
						break
					elif choice3 == "q":
						flag_exit = True
					elif choice3 not in menu[choice1][choice2]:
						print("你输入的有误，请重新选择")
			elif choice2 == "b":
				break
			elif choice2 == "q":
				flag_exit = True
			elif choice2 not in menu[choice1]:
				print("你输入的有误，请重新选择")
	elif choice1 == "b":
		break
	elif choice1 == "q":
		flag_exit = True
	elif choice1  not in menu:
		print("你输入的有误，请重新选择")
		if choice1 == "b":
			break
		elif choice1 == "q":
			flag_exit = True