#!/usr/bin/env python3
# -*- coding:utf-8 -*-
# Author: davie
"""
1、机器语言：
	由于计算机内部只能接受二进制代码，因此，用二进制代码0和1描述的指令称为机器指令，
全部机器指令的集合构成计算机的机器语言。
	机器语言属于低级语言。编出的程序全是写0和1的指令代码，直观性差，还容易出错。
除了计算机生产厂家的专业人员外，绝大多数的程序员已经不再去学习机器语言了。
	机器语言是未处理器理解和使用的。尽管机器语言好像是很负责的，然而它是有规律的。
	存在着多至100000种机器语言的指令，这意味着不能把这些种类全部列出来。
2、汇编语言：
	汇编语言的实质和机器语言是相同的，都是直接对硬件操作，只不过指令采用了英文缩写
的标识符，更容易识别和记忆。
	它同样需要编程者将每一步具体的操作使用命令的形式写出来。汇编程序的每一句指令只能
对应实际操作过程中的一个很细微的动作。例如移动，自增，因此汇编语言程序一般比较冗长，
复杂，容易出错，而且使用汇编语言编程需要更多的计算机专业知识。
	但汇编语言的有点也是显而易见的，用汇编语言所能完成的操作不是一般高级语言所能够
实现的，而且源程序经汇编生成的可执行文件不仅比较小，而且执行速度很快。
3、高级语言
"""